; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v9 ?v7)
             (pred_2 ?v10 ?v12)
             (pred_6 ?v9 ?v12)
             (pred_7 ?v13 ?v9 )
	     (pred_10 ?v9)
             (pred_9 ?v4)
             (pred_3 ?v10)
             (pred_1 ?v12)
             (pred_5 ?v9)
             (pred_12 ?v10)
             (pred_11 ?v9)
             (pred_8 ))



(:action op_3
:parameters (?v1 ?v8 ?v6 ?v5)
:precondition (and (pred_9 ?v1) (pred_9 ?v8) (pred_3 ?v6) (pred_1 ?v5)
          (pred_4 ?v1 ?v8) (pred_2 ?v6 ?v5)
                   (pred_6 ?v8 ?v5) (pred_10 ?v1) 
                   (pred_5 ?v8) (pred_12 ?v6))
:effect (and  (pred_11 ?v8) (not (pred_5 ?v8))))


(:action op_5
:parameters (?v1 ?v2)
:precondition (and (pred_9 ?v1) (pred_9 ?v2)
               (pred_10 ?v1) (pred_4 ?v1 ?v2) (pred_11 ?v2))
:effect (and (pred_10 ?v2) (not (pred_10 ?v1))))

(:action op_1
:parameters (?v1 ?v6)
:precondition (and (pred_9 ?v1) (pred_3 ?v6) 
                  (pred_10 ?v1) (pred_7 ?v6 ?v1) (pred_8 ))
:effect (and (pred_12 ?v6)
   (not (pred_7 ?v6 ?v1)) (not (pred_8 ))))


(:action op_2
:parameters (?v1 ?v11 ?v3)
:precondition (and (pred_9 ?v1) (pred_3 ?v11) (pred_3 ?v3)
                  (pred_10 ?v1) (pred_12 ?v3) (pred_7 ?v11 ?v1))
:effect (and (pred_12 ?v11) (pred_7 ?v3 ?v1)
        (not (pred_12 ?v3)) (not (pred_7 ?v11 ?v1))))

(:action op_4
:parameters (?v1 ?v6)
:precondition (and (pred_9 ?v1) (pred_3 ?v6) 
                  (pred_10 ?v1) (pred_12 ?v6))
:effect (and (pred_8 ) (pred_7 ?v6 ?v1) (not (pred_12 ?v6)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_05 obj_04 obj_02 obj_09 obj_12 obj_08 obj_11 obj_06
    obj_01 obj_13
    obj_10 obj_03
    )

    (:init
       (pred_8)

       (pred_9 obj_07)
       (pred_9 obj_05)
       (pred_9 obj_04)
       (pred_9 obj_02)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_13)
       (pred_3 obj_10)
       (pred_3 obj_03)

       (pred_4 obj_07 obj_02)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_08 obj_11)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_11 obj_06)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_11 obj_08)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_11)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_6  obj_11 obj_01)
       (pred_6  obj_12 obj_13)
       (pred_11 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_08)
       (pred_11 obj_06)

       (pred_2  obj_10 obj_01)
       (pred_2  obj_03 obj_13)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_03 obj_08)
       (pred_10 obj_05)
    )

    (:goal (and
       (pred_7 obj_10 obj_05)
       (pred_7 obj_03 obj_02)
    ))
(:constraints
  (always (not (pred_10 obj_07)))
)
)

; plan
1. (op_5 obj_05 obj_09)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_09)
   goals met: 0 of 2
2. (op_5 obj_09 obj_02)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_02)
   goals met: 0 of 2
3. (op_1 obj_02 obj_10)
   deleted: (pred_7 obj_10 obj_02) (pred_8)
   added: (pred_12 obj_10)
   goals met: 0 of 2
4. (op_5 obj_02 obj_08)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_08)
   goals met: 0 of 2
5. (op_2 obj_08 obj_03 obj_10)
   deleted: (pred_12 obj_10) (pred_7 obj_03 obj_08)
   added: (pred_12 obj_03) (pred_7 obj_10 obj_08)
   goals met: 0 of 2
6. (op_5 obj_08 obj_02)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_02)
   goals met: 0 of 2
7. (op_4 obj_02 obj_03)
   deleted: (pred_12 obj_03)
   added: (pred_8) (pred_7 obj_03 obj_02)
   goals met: 1 of 2
8. (op_5 obj_02 obj_08)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_08)
   goals met: 1 of 2
9. (op_1 obj_08 obj_10)
   deleted: (pred_7 obj_10 obj_08) (pred_8)
   added: (pred_12 obj_10)
   goals met: 1 of 2
10. (op_5 obj_08 obj_02)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_02)
   goals met: 1 of 2
11. (op_5 obj_02 obj_09)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_09)
   goals met: 1 of 2
12. (op_5 obj_09 obj_05)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_05)
   goals met: 1 of 2
13. (op_4 obj_05 obj_10)
   deleted: (pred_12 obj_10)
   added: (pred_8) (pred_7 obj_10 obj_05)
   goals met: 2 of 2
